#ifndef C_7841_CAN_CHANNEL_H
#define C_7841_CAN_CHANNEL_H

//****************************************************************************************************
//Класс настройки канала
//****************************************************************************************************

//****************************************************************************************************
//подключаемые библиотеки
//****************************************************************************************************
#include <stdint.h>
#include "c7841userspeed.h"

//****************************************************************************************************
//Класс настройки канала
//****************************************************************************************************

class C7841CANChannel
{
 //-перечисления---------------------------------------------------------------------------------------
 public: 
  //скорость
  enum CAN7841_SPEED
  {
   CAN7841_SPEED_125KBS,//скорость 125 кбит/с
   CAN7841_SPEED_250KBS,//скорость 250 кбит/с
   CAN7841_SPEED_500KBS,//скорость 500 кбит/с
   CAN7841_SPEED_1MBS,//скорость 1 Мбит/с
   CAN7841_SPEED_USER //скорость опеределяется пользователем
  };	
 //-переменные-----------------------------------------------------------------------------------------
 public:
  bool ExtendedMode;//расширенный режим 
  uint32_t Arbitration;//арбитраж
  uint32_t ArbitrationMask;//маска арбитража
  CAN7841_SPEED Speed;//скорость 
  C7841UserSpeed c7841UserSpeed;//настройки пользовательской скорости (для режима CAN7841_SPEED_USER)
 //-конструктор----------------------------------------------------------------------------------------
 public:
  C7841CANChannel(bool extended_mode=false,uint32_t arbitration=0,uint32_t arbitration_mask=0xffffffff,CAN7841_SPEED speed=CAN7841_SPEED_1MBS,C7841UserSpeed c7841UserSpeed_Set=C7841UserSpeed());
 //-деструктор-----------------------------------------------------------------------------------------
  ~C7841CANChannel(void);
 //-открытые функции-----------------------------------------------------------------------------------
 public:
  bool IsExtendedMode(void) const;//получить, расширенный ли режим 
  bool IsSpeed(CAN7841_SPEED speed) const;//получить, соответствует ли скорость заданной
 //-закрытые функции-----------------------------------------------------------------------------------
 private: 
};

#endif


