#ifndef C_PCI_7841_CAN_CHANNEL_H
#define C_PCI_7841_CAN_CHANNEL_H

//****************************************************************************************************
//Класс настройки канала
//****************************************************************************************************

//****************************************************************************************************
//подключаемые библиотеки
//****************************************************************************************************
#include <stdint.h>
#include "cpci7841userspeed.h"

//****************************************************************************************************
//Класс настройки канала
//****************************************************************************************************

class CPCI7841CANChannel
{
 //-перечисления---------------------------------------------------------------------------------------
 public:
  //скорость
  enum CAN_SPEED
  {
   CAN_SPEED_125KBS,//скорость 125 кбит/с
   CAN_SPEED_250KBS,//скорость 250 кбит/с
   CAN_SPEED_500KBS,//скорость 500 кбит/с
   CAN_SPEED_1MBS,//скорость 1 Мбит/с
   CAN_SPEED_USER //скорость опеределяется пользователем
  };
 //-переменные-----------------------------------------------------------------------------------------
 public:
  bool ExtendedMode;//расширенный режим
  uint32_t Arbitration;//арбитраж
  uint32_t ArbitrationMask;//маска арбитража
  CAN_SPEED Speed;//скорость
  CPCI7841UserSpeed cPCI7841UserSpeed;//настройки пользовательской скорости (для режима CAN7841_SPEED_USER)
 //-конструктор----------------------------------------------------------------------------------------
 public:
  CPCI7841CANChannel(bool extended_mode=false,uint32_t arbitration=0,uint32_t arbitration_mask=0xffffffff,CAN_SPEED speed=CAN_SPEED_1MBS,CPCI7841UserSpeed cPCI7841UserSpeed_Set=CPCI7841UserSpeed());
 //-деструктор-----------------------------------------------------------------------------------------
  ~CPCI7841CANChannel(void);
 //-открытые функции-----------------------------------------------------------------------------------
 public:
  bool IsExtendedMode(void) const;//получить, расширенный ли режим
  bool IsSpeed(CAN_SPEED speed) const;//получить, соответствует ли скорость заданной
 //-закрытые функции-----------------------------------------------------------------------------------
 private:
};

#endif



